rest-server/src/test/resources/wiremock/fixtures/ExternalAuthenticate.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns4:ExternalAuthenticate xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:ns2="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:ns3="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:ns4="http://ws.gematik.de/conn/SignatureService/v7.4" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://ws.gematik.de/tel/error/v2.0" xmlns:ns7="urn:oasis:names:tc:dss-x:1.0:profiles:verificationreport:schema#" xmlns:ns8="http://uri.etsi.org/01903/v1.3.2#" xmlns:ns9="http://uri.etsi.org/02231/v2#" xmlns:ns10="urn:oasis:names:tc:dss-x:1.0:profiles:SignaturePolicy:schema#" xmlns:ns11="http://ws.gematik.de/conn/CertificateServiceCommon/v2.0" xmlns:ns12="http://www.w3.org/2001/04/xmlenc#" xmlns:ns13="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns14="urn:oasis:names:tc:SAML:1.0:assertion">
            <CardHandle>SMC-B-11</CardHandle>
            <ns2:Context>
                <MandantId>Incentergy</MandantId>
                <ClientSystemId>Incentergy</ClientSystemId>
                <WorkplaceId>1786_A1</WorkplaceId>
                <UserId/>
            </ns2:Context>
            <ns4:OptionalInputs>
                <ns3:SignatureType>urn:bsi:tr:03111:ecdsa</ns3:SignatureType>
            </ns4:OptionalInputs>
            <ns4:BinaryString>
                <ns3:Base64Data MimeType="application/octet-stream">wmBKvpNl3pwykknHpGKGkNiF9gWiHOpy+zfmhPaBhEM=</ns3:Base64Data>
            </ns4:BinaryString>
        </ns4:ExternalAuthenticate>
    </soap:Body>
</soap:Envelope>